app/views/visitors/index.html.erb


<p><%= link_to 'Usuários:', users_path %> <%= User.count %> registrados</p>
---
SELECT COUNT(*) FROM "users"