app/controllers/userdata_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def create
    @userdatum = Userdatum.new(userdatum_params)
    @userdatum.user = User.find User.decrypt (session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_userdatum
      @userdatum = Userdatum.find User.decrypt (params[:id])